<template>
  <div class="home">
    <!--<img alt="Vue logo" src="../assets/logo.png">-->
    <!--<HelloWorld msg="Welcome to Your Vue.js + TypeScript App"/>-->
    <a-card style="text-align: left">
      <h1>故事梗概</h1>
      <p>康熙初年，浙江富绅庄允诚遭革职知县吴之荣举报，告发其子所编《明史》中使用前明年号。权臣鳌拜即大兴文字狱，庄家遭全家抄斩，更牵连有份编修，以至买卖此籍之民众，这便是轰动全国的庄廷鑨明史案。</p>

      <p>小说的主人公<b>韦小宝</b>成长于扬州妓院丽春院，母亲韦春花是院内妓女。十二三岁的<b>韦小宝</b>救了越狱犯茅十八一命，茅十八夸口要上京与“满洲第一勇士”鳌拜决斗，<b>韦小宝</b>便随他北上。</p>

      <p>两人在京城遭尚膳监总管海大富擒进宫中。<b>韦小宝</b>暗中将海大富毒盲，把服侍他的小太监小桂子杀死后，冒充为小桂子以应付眼盲的海大富，助茅十八脱身。<b>韦小宝</b>受海大富命令，在宫中找寻《四十二章经》，无意中结识了自称“小玄子”的康熙皇帝及建宁公主，成为好友，更助康熙生擒鳌拜。海大富凭着小宝与康熙比武的招式，推敲出杀死康熙生母孝康章皇后，以及孝献端敬皇后及其子荣亲王等人的凶手正是太后，依照顺治帝从前的命令，往取太后性命，激斗后却为太后所杀。而<b>韦小宝</b>从海大富与太后之间的对话中，得知康熙生父顺治尚在人间。</p>

      <p><b>韦小宝</b>奉命去杀囚在康亲王府中的鳌拜，竟遇上欲刺杀鳌拜的天地会一众，<b>韦小宝</b>在混乱中杀死了鳌拜，之后被一众天地会刺客掳走。天地会总舵主陈近南为平息谁人当上新任青木堂香主之争论，以<b>韦小宝</b>杀死鳌拜为青木堂前任堂主复仇为由，收了<b>韦小宝</b>为徒，再让他当上青木堂香主。之后天地会因南明正统问题与沐王府结怨，更把沐王府郡主沐剑屏绑走，送进<b>韦小宝</b>宫中住处收藏。<b>韦小宝</b>又救了沐剑屏的师姐、因入宫行刺康熙而受伤的方怡。太后欲杀<b>韦小宝</b>灭口，可是屡次派人对付不果。<b>韦小宝</b>既身处险境，原打算将海大富查得的秘密告知康熙后便偷走出宫，康熙反而派小宝到五台山打听顺治下落。<b>韦小宝</b>借机将沐剑屏、方怡及其他失陷的沐王府刺客带出宫外。</p>

      <p>众人在庄家避雨时，被与太后有不明关系的神龙教教众擒下，<b>韦小宝</b>却得在此隐居的明史案遗眷庄三少奶所救。庄三少奶为答谢<b>韦小宝</b>手刃了仇人鳌拜，把武功不俗的小丫头双儿相赠。</p>

      <p><b>韦小宝</b>在五台山清凉寺寻到出了家的顺治，并告之海大富查出端敬皇后等人死亡之真相。此时喇嘛大举来犯，幸得少林寺僧人及时出手阻止。<b>韦小宝</b>在回京覆旨途中，被方怡诱上神龙岛，原来方怡、沐剑屏早已被逼入教。适逢神龙教内乱，<b>韦小宝</b>初识教主洪安通及苏荃，巧将乱事摆平，更成为神龙教中白龙使，奉命入宫继续找寻《四十二章经》。</p>

      <p>康熙得知顺治在清凉寺，为掩人耳目，先派<b>韦小宝</b>到少林寺出家。路上，<b>韦小宝</b>及众侍卫遭王屋派偷袭，由此认识了少女曾柔，<b>韦小宝</b>藉宝刀宝衣反制王屋派，却又借赌局将他们释放。</p>

      <p><b>韦小宝</b>剃度后，在寺外遇到来少林寺挑衅的阿珂，深深为其美貌倾倒。<b>韦小宝</b>后来转往清凉寺当住持，大批喇嘛再次围攻清凉寺，小宝施计带领众人逃出，刚好遇上康熙率众前来。众喇嘛被擒，而康熙父子得以相认。</p>

      <p>康熙到达清凉寺，白衣尼九难前来行刺，<b>韦小宝</b>藉宝衣替他挡了一剑，自己却被掳走。小宝花言巧语取得了九难信任，与九难潜入皇宫，得悉九难竟是前明长平公主。九难揭穿了太后原来是毛东珠假扮，真太后被她藏了起来。二人出宫，<b>韦小宝</b>发现阿珂竟是九难的徒弟，无奈阿珂却倾情于台湾延平郡王郑经的次子郑克塽。</p>

      <p><b>韦小宝</b>回宫后，将假太后的秘密告知康熙，两人救出了真太后。<b>韦小宝</b>奉旨送建宁公主到云南嫁给平西王世子吴应熊，途中却被建宁诱惑而与其私通。抵达云南后，建宁更将吴应熊弄成太监。此时九难派阿珂行刺吴三桂，失手被擒，而<b>韦小宝</b>从陈圆圆口中得知阿珂是她与李自成的女儿。最后吴三桂为九难所制，众人终于胁持着吴应熊离开了云南。</p>

      <p>返京后，康熙再派<b>韦小宝</b>出海剿灭神龙教，反被教主洪安通施计擒住。<b>韦小宝</b>得双儿暗中救走，二人向北逃遁，竟闯至罗刹国在鹿鼎山建筑的雅克萨城，更随苏菲亚公主同赴莫斯科，并助其发动政变夺权。最后<b>韦小宝</b>带回罗刹国特使与清朝修好。</p>

      <p>康熙让<b>韦小宝</b>衣锦还乡，得以回扬州与母亲韦春花重聚。<b>韦小宝</b>此行又成功替康熙拢落了西藏桑结和蒙古葛尔丹，更在丽春院与阿珂、双儿、曾柔、方怡、沐剑屏、苏荃等六女大被同眠。回京途中遇到打算入宫行刺康熙的归辛树一家，<b>韦小宝</b>在天地会面前把皇宫布局告诉了归家，背后却通报康熙加紧防卫，最后归家三人力尽为宫中侍卫所杀。此时，康熙突然点破<b>韦小宝</b>在天地会的身份，并准备炮轰韦府，以杀天地会与沐家众人。<b>韦小宝</b>藉建宁公主之助，逃脱并救出了众人。</p>

      <p><b>韦小宝</b>再次被神龙教擒住，押回神龙岛，岂料洪安通发现妻子苏荃怀了<b>韦小宝</b>的孩子，为了掩饰，与神龙教中人互相残杀致同归于尽，祇得苏荃幸免。大变后众人转往通吃岛，台湾郑家、天地会及施琅所领的大清水师先后追至。清廷水师被击退后，陈近南为郑克塽暗算身亡。</p>

      <p><b>韦小宝</b>在通吃岛上过了数年无忧无虑的逍遥日子，清廷相继平定三藩之乱与台湾郑氏政权，康熙三番两次派人召回<b>韦小宝</b>。因<b>韦小宝</b>有去过罗刹国并帮助过苏菲亚公主政变夺权，令其到东北出征罗刹国，以签订有利条约。事成后，知道小宝为天地会卧底的康熙开始用计逼小宝效忠，故意在圣旨中宣称<b>韦小宝</b>杀害陈近南，引来天地会的会众误会，而小宝获恩准回扬州探母，途中顾炎武等人来劝<b>韦小宝</b>率领起义反清。由于康熙与天地会已经闹到都要逼<b>韦小宝</b>公开表态的地步，心烦意乱的<b>韦小宝</b>一怒之下决定将这些鸟事抛诸脑后，于是假装全家遭到劫杀，携了妻儿和母亲到大理城隐居，两不相帮不问世事。康熙不相信<b>韦小宝</b>轻易遇害，无奈屡次查访均未果。</p>

      <p><b>韦小宝</b>向母亲询问自己父亲是谁，韦春花说年轻时恩客颇多，汉满蒙回藏都有，是标准的父不详。</p>
    </a-card>
  </div>
</template>

<script lang="ts">
import {defineComponent} from 'vue';
import {IpcChannel} from "@/ipc/ipc_channel";
import ipcRenderWrap from "@/ipc/ipc_render_wrap"
import Test1 from "@/views/Test1.vue";
const Store = require('electron-store');

const store = new Store();


export default defineComponent({
  name: 'Home',
  components: {
  },
  methods: {
    clickMe() {
      console.log('clickMe', this);
      store.set("abc", 346578697);
      console.log(store.get("abc"));
      store.set("a.b.c", 5);
      console.log(store.get("a"));


      ipcRenderWrap.send(IpcChannel.getTplContent, (event, args) => {
        console.log('send 22222222222222');
      }, 'xxxx')
    },
  }
});
</script>
